%определить предикат mrg(L1, L2, R) который для двух отсортированных
% списков L1 и L2 определяет список R, составленный из этих элементов

mrg(L1, L2, R):- merge(L1, L2, R).
merge([],[],[]).
merge(L1, [], L1).
merge([], L1, L1).
merge(L1, L2, R) :- L1 = [H1|T1],
    L2 = [H2|_], H1 =< H2,
    R = [H1|TRes], mrg(T1, L2, TRes).
merge(L1, L2, R) :- L1 = [H1|_],
    L2 = [H2|T2], H1 > H2,
    R = [H2|TRes],  mrg(L1, T2, TRes).

%?- mrg([-2,2,6],[-3,5,11,15],R).
%R = [-3, -2, 2, 5, 6, 11, 15]

%?- mrg([],[-3,5],R).
%R = [-3, 5]

%?- mrg([],[],R).
%R = []
